<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Organon\Marketplace\Models\SellerCategory;

class SellerCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $sellerCategories = [
            'طبي' => ["صيدليات", "تجهيزات طبية", "مستودعات ادوية", "مشافي خاصة", "مراكز طبية", "مخابر", "تصوير شعاعي", "عيادات", "البصريات", "البيطرية", "مخابر اسنان", "خدمات طبية منزلية"],
            'تموينات' => ["سوبر ماركت وبقاليات", "محامص وضيافة", "منظافات", "لحوم", "خضار وفواكه", "البان واجبان", "بزوريات", "عطارة وبهارات", "عسل"],
            'مشروبات روحية' => [],
            'التكنولوجيا والالكترونيات' => ["الجوالات", "الكومبيوتر", "الاكسسوارات التكنولوجية"],
            'الموضة والأزياء' => ["البسة رجالي", "البسة نسائي", "البسة اطفال", "قطنيات", "لانجري", "فساتين سهرة و اعراس", "احذية", "حقائب", "اكسسوارات"],
            'تعليم' => ["معاهد", "روضات", "مدارس خاصة", "قرطاسية", "جامعات خاصة", "خدمات طلابية", "متاجر الكتب والروايات"],
            'رياضة' => ["نوادي ومسابح", "معدات رياضية", "مكملات", "دراجات ومعدات الركوب", "البسة واحذية رياضية"],
            'الجمال والعناية الشخصية' => ["حلاق رجالي", "كوافير نسائي", "مراكز التجميل", "مكياجات"],
            'الأثاثات المنزلية' => ["تجهيزات كهربائية", "عصرونية", "مفروشات", "اقمشة وستائر", "موكيت وسجاد", "اثاث مستعمل"],
            'مأكولات ومشروبات' => ["شرقي", "غربي", "معجنات", "فلافل وفتات", "عصائر وكوكتيلات"],
            'مخابز وحلويات' => ["حلويات", "مخابز"],
            'مقاهي' => [],
            'السياحة والضيافة' => ["فنادق", "مكاتب سياحة وسفر", "منتجعات سياحية", "شاليهات", "استراحات"],
            'النقل والشحن' => ["مكاتب التكسي", "شركات النقل", "شركات الشحن", "مكاتب توصيل الطلبات", "شركات الشحن الدولي"],
            'المصارف والتمويل' => ["البنوك والمصارف", "شركات التحويل", "شركات الدفع الالكتروني", "شركات الصيرفة", "شركات الـتأمين"],
            'الخدمات' => ["خدمات قانونية", "تسويق واعلان", "خدمات هندسية", "خدمات طلابية", "خدمات التكنولوجيا والمعلومات", "مهن حرفية", "نجارة والمنيوم", "حداد", "سباكة وكهربا", "خدمات السيارات", "تنظيف منازل", "مغسلة ومصبغة", "معتمد غاز", "بناء وتشييد", "تفصيل وخياطة", "ديكورات", "الزراعة والبستنة", "تصليح ادوات منزلية", "زجاج ومرايا", "استيراد وتصدير", "المطابع", "خدمات مالية", "خدمات التصوير الفوتغرافي", "dj", "خدمات الترجمة", "تمريض منزلي"],
            'مواد البناء' => ["الكهرباء والانارة", "سباكة وصحية", "خرداوات", "دهانات", "الطاقة البديلة", "مواد التشييد"],
            'المجوهرات' => [],
            'عقارات وسيارات' => ["مكاتب عقارية", "مكاتب هندسية", "معارض سيارات", "تأجير سيارات", "صالات وقاعات", "تعهدات عامة ومقاولات", "معدات زراعية"],
            'اكسسوارات وهدايا وألعاب' => ["العاب اطفال", "محلات ورد", "محلات العطور", "الاكسسوار والساعات"],
            'المصانع' => ["اغذية", "بلاستيك", "صناعات ثقيلة", "مستلزمات صناعية", "مستلزمات مطاعم وفنادق", "الغزل والنسيج", "الصناعات الكيمائية", "الصناعات الدوائية", "التعبئة والتغليف"],
            'الحرف اليدوية' => ["المونة المنزلية", "الحفر على الخشب", "الشمع", "تنسيق الهدايا", "كروشيه وصوف", "تزيين حفلات", "اشغال خرز", "فنون يدوية"],
            'الزراعة والبستنة' => ["صيدليات زراعية", "مهندسين زراعيين", "مشاتل", "تنسيق حدائق", "مزارعين"],
        ];

        foreach ($sellerCategories as $name => $subCategories) {
            $sellerCategory = SellerCategory::create([
                'name' => $name,
                'parent_id' => null,
            ]);
            $sellerCategory->addMediaFromDisk('images/categories/' . $name . '.png')->preservingOriginal()->toMediaCollection('image', 'public');
            foreach ($subCategories as $subCategory)
                SellerCategory::create([
                    'name' => $subCategory,
                    'parent_id' => $sellerCategory->id,
                ]);
        }
    }
}